app/controllers/bonus_codes_controller.rb

SELECT  "bonus_codes".* FROM "bonus_codes" WHERE "bonus_codes"."id" = ? LIMIT 1  [["id", nil]]
---
  def index
    @bonus_codes = BonusCode.find(params[:product_id])